{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, blob storage, and CRUD operations for equipment, assignments, issues, sessions, and activity logs.",
  "feature_evidence.json": "Metadata describing a feature requirement to update frontend App.tsx behavior based on auth state, including affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files covering authentication routing, React Query hooks, screens, components, service worker, and manifest behavior.",
  "frontend/docs/ANDROID_APK_GUIDE.md": "Guide explaining how to generate an Android APK from the PWA using PWABuilder or other methods.",
  "frontend/docs/APK_BUILD_INSTRUCTIONS.md": "Detailed instructions for packaging the Ramp Track PWA as an Android APK using TWA via PWABuilder or Bubblewrap.",
  "frontend/docs/APK_DEPLOYMENT_GUIDE.md": "Guide describing how to deploy and distribute the generated Android APK for the Ramp Track PWA.",
  "frontend/docs/APK_DOWNLOAD_LINK.md": "Instructions for hosting and distributing the generated APK, including GitHub Releases usage.",
  "frontend/docs/APK_QUICK_START.md": "Quick-start steps for generating an Android APK from the PWA using PWABuilder.",
  "frontend/docs/INCIDENT_REPORT.md": "Incident report detailing credit overuse, deployment issues, scanner problems, and requested support actions.",
  "frontend/index.html": "HTML entry file setting up PWA metadata, splash assets, QR library, and service worker registration with auto-update logic.",
  "frontend/index.ts": "Code snippet performing ZXing image decoding from canvas image data using readerRef.",
  "frontend/public/manifest.json": "Defines PWA metadata, icons, screenshots, shortcuts, and share-target settings for the Ramp Track app.",
  "frontend/public/sw.js": "Implements a versioned service worker handling static caching, cache cleanup, and selective network-first or bypassed fetch behavior.",
  "frontend/src/App.tsx": "Main application component managing authentication state, view routing, and reconnecting overlay behavior.",
  "frontend/src/components/AuthDiagnosticsPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/DemoLoginHandler.tsx": "Empty placeholder component file.",
  "frontend/src/components/EquipmentQRScanner.tsx": "Provides a QR scanner using camera streams with a stable video element, overlay UI, and scan handling for login or equipment modes.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary capturing runtime errors and offering reload, cache clearing, and optional diagnostic details.",
  "frontend/src/components/LoginScreen.tsx": "Login UI supporting username/password or badge scan authentication with error handling and scanner integration.",
  "frontend/src/components/NotFound.tsx": "Renders a full-screen 404 page with a home button and background image.",
  "frontend/src/components/OfflineIndicator.tsx": "Empty file with no implemented logic.",
  "frontend/src/components/PWAUpdateNotification.tsx": "Empty file with no implemented logic.",
  "frontend/src/components/ReconnectingOverlay.tsx": "Shows a dismissible overlay with a spinner during session reconnecting, using fade animations.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Displays a role selection UI with back navigation and user info from AuthContext.",
  "frontend/src/components/SignOnScreen.tsx": "Provides login role choice buttons for signed-in users and redirects back if no user is present.",
  "frontend/src/components/SplashScreen.tsx": "Shows a splash screen with a branded background and loading spinner.",
  "frontend/src/contexts/AuthContext.tsx": "Implements authentication context with session hydration, login, logout, and refresh logic.",
  "frontend/src/data/gates.ts": "Exports static gate coordinate data with IDs, lat/lon, and radius values.",
  "frontend/src/data/userRoster.ts": "Contains the full user roster with badge IDs, roles, and credentials for authentication.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAuth.tsx": "Empty placeholder file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling AuthClient setup, identity persistence, and login state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for equipment, assignments, and issues using the actor, including validation and mutation side effects.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, color variables, and touch‑optimized UI settings.",
  "frontend/src/lib/apiClient.ts": "Centralized authenticated fetch utility with token handling, error classification, and refresh state tracking.",
  "frontend/src/lib/auditLog.ts": "Manages local audit logs for scan events, including storing, filtering, and retrieving user and equipment‑specific entries.",
  "frontend/src/lib/autoGateLocator.ts": "Provides GPS-based nearest-gate detection using the Haversine formula and a 120m threshold.",
  "frontend/src/lib/ensureUserContext.ts": "Loads user context from localStorage with fallbacks and validates sessions without clearing local auth on backend failures.",
  "frontend/src/lib/equipmentHistory.ts": "Implements an in-memory equipment event log with functions to add, query, sort, and clear events.",
  "frontend/src/lib/equipmentRegistry.ts": "Maintains a localStorage-backed equipment registry with normalization, auto-initialization, and required equipment enforcement.",
  "frontend/src/lib/parseBadge.ts": "Extracts the longest digit sequence from scanner input as a badge ID, returning null if fewer than four digits.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing equipment, assignments, logs, local registry data, and audit search tools with periodic refresh.",
  "frontend/src/pages/CheckInScreen.tsx": "Check-in workflow handling scans, validation, GPS-based location tagging, session checks, and equipment status updates.",
  "frontend/src/pages/CheckOutScreen.tsx": "Implements equipment checkout using QR scanning, validation, GPS capture, and backend update flows.",
  "frontend/src/pages/DEBUG_SAFE.tsx": "Simple debug screen confirming root app load.",
  "frontend/src/pages/EquipmentDetailScreen.tsx": "Displays equipment details and history with fallback UI if the ID is invalid.",
  "frontend/src/pages/ManageEquipmentScreen.tsx": "Provides UI to add, edit, and search equipment records with validation and session checks.",
  "frontend/src/pages/OperatorHomeScreen.tsx": "Home menu for operators to start actions like checkout, return, or reporting issues.",
  "frontend/src/pages/ProfileSetupScreen.tsx": "Empty placeholder for profile setup screen.",
  "frontend/src/pages/RampControl.tsx": "Empty placeholder for ramp control screen.",
  "frontend/src/pages/ReportIssueScreen.tsx": "Handles scanning equipment, entering issue details, capturing photos, and submitting issue reports.",
  "frontend/src/pages/SignInScreen.tsx": "React login screen handling operator/admin modes, calling AuthContext.login and managing form state and UI.",
  "frontend/src/types/zxing.d.ts": "TypeScript declarations for ZXingBrowser barcode/QR reader interfaces loaded from CDN.",
  "frontend/src/utils/urlParams.ts": "URL/session parameter utilities for reading, persisting, and clearing query values across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended color system, animations, container settings, and plugins.",
  "project_state.json": "Project state metadata describing features, architecture, and known issues for Ramp Track.",
  "unknown.bash": "Build script running pnpm build inside the frontend directory.",
  "unknown.txt": "Instructions for distributing and installing an Android APK plus feature list and troubleshooting."
}