{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, equipment tracking, assignments, issues, session logs, and blob storage with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report listing recent frontend changes tied to App.tsx navigation, auth handling, and reconnect overlay behavior.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to concise functional descriptions of screens, hooks, components, and service worker behavior.",
  "frontend/docs/ANDROID_APK_GUIDE.md": "Guide explaining how to generate an Android APK from the PWA using PWABuilder and required prerequisites.",
  "frontend/docs/APK_BUILD_INSTRUCTIONS.md": "Detailed steps for building an Android APK via PWABuilder or Bubblewrap, including configuration and testing requirements.",
  "frontend/docs/APK_DEPLOYMENT_GUIDE.md": "Instructions for deploying and distributing the generated Android APK after PWA readiness checks.",
  "frontend/docs/APK_DOWNLOAD_LINK.md": "Short guide describing how to host and share the generated APK, with GitHub Releases as the primary method.",
  "frontend/docs/APK_QUICK_START.md": "Fast-start guide for generating the Android APK in minutes using PWABuilder after HTTPS deployment.",
  "frontend/docs/INCIDENT_REPORT.md": "Incident report describing credit overuse, deployment failures, scanner issues, and requests for audit and engineering support.",
  "frontend/index.html": "Main HTML entrypoint setting up PWA metadata, preloading assets, loading ZXing, and registering an auto‑updating service worker.",
  "frontend/index.ts": "Contains code to decode image data using a readerRef for QR or barcode processing.",
  "frontend/public/manifest.json": "Defines PWA metadata including icons, shortcuts, theme colors, and share targets for Ramp Track.",
  "frontend/public/sw.js": "Service worker implementing versioned caching, update handling, cache cleanup, and network-first navigation with asset bypass rules.",
  "frontend/src/App.tsx": "Top-level React app handling auth state, hash-based navigation, overlay logic, and conditional rendering of app screens.",
  "frontend/src/components/AuthDiagnosticsPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/DemoLoginHandler.tsx": "Empty placeholder component file.",
  "frontend/src/components/EquipmentQRScanner.tsx": "React component providing camera-based QR scanning with overlays, torch control, and callbacks for decoded results.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary UI that captures runtime errors and provides reload, cache clearing, and optional diagnostics display.",
  "frontend/src/components/LoginScreen.tsx": "Provides username/password and badge-scan login with validation, error handling, and auth context integration.",
  "frontend/src/components/NotFound.tsx": "Renders a styled 404 page with a button to navigate back home.",
  "frontend/src/components/OfflineIndicator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/PWAUpdateNotification.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ReconnectingOverlay.tsx": "Displays a dismissible fullscreen overlay with a spinner while sessions refresh or reconnect.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Shows role options for the authenticated user and provides navigation buttons for agent or admin flows.",
  "frontend/src/components/SignOnScreen.tsx": "Presents agent/admin login choices based on user roles and redirects if no user is present.",
  "frontend/src/components/SplashScreen.tsx": "Shows a branded splash screen with a loading indicator during app startup.",
  "frontend/src/contexts/AuthContext.tsx": "Implements authentication state, session storage hydration, login handling, and refresh logic using React context.",
  "frontend/src/data/gates.ts": "Exports a static read-only list of gate coordinate data with IDs, lat/lon, and radius values.",
  "frontend/src/data/userRoster.ts": "Defines the UserRosterEntry interface and exports a full hardcoded user roster used for authentication and badge validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Empty file placeholder for authentication-related React hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for equipment, assignment, and issue operations using the backend actor with session validation.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with aviation-focused design.",
  "frontend/src/lib/apiClient.ts": "Implements a centralized API request utility with auth token handling, error processing, and profile-missing detection.",
  "frontend/src/lib/auditLog.ts": "Manages scan audit events with localStorage, including user lookup, event appending, filtering, and clearing.",
  "frontend/src/lib/autoGateLocator.ts": "Determines nearest gate using GPS coordinates with a Haversine distance check and returns a gate label or Out of area.",
  "frontend/src/lib/ensureUserContext.ts": "Retrieves user context from localStorage with fallbacks and validates session state without clearing auth on backend failures.",
  "frontend/src/lib/equipmentHistory.ts": "Provides an in-memory log of equipment events with functions to add, query, sort, and clear history.",
  "frontend/src/lib/equipmentRegistry.ts": "Maintains a localStorage-backed equipment registry with normalization, initialization, and required equipment handling.",
  "frontend/src/lib/parseBadge.ts": "Extracts the longest digit sequence from scanner input as a badge ID, returning null if fewer than four digits.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements the admin dashboard UI with equipment data, audit logs, filters, and update operations.",
  "frontend/src/pages/CheckInScreen.tsx": "UI flow for checking in equipment via QR scan, validating status, capturing GPS, and updating backend logs.",
  "frontend/src/pages/CheckOutScreen.tsx": "Handles equipment checkout with QR scanning, availability validation, GPS capture, and assignment creation.",
  "frontend/src/pages/DEBUG_SAFE.tsx": "Simple debug screen confirming the app root loads.",
  "frontend/src/pages/EquipmentDetailScreen.tsx": "Displays equipment details and history with UI for status badges and not-found handling.",
  "frontend/src/pages/ManageEquipmentScreen.tsx": "Admin tool for listing, searching, adding, and editing equipment records with validation and dialogs.",
  "frontend/src/pages/OperatorHomeScreen.tsx": "Operator landing page showing user identity and navigation to major actions like take/return equipment.",
  "frontend/src/pages/ProfileSetupScreen.tsx": "Empty placeholder file for profile setup UI.",
  "frontend/src/pages/RampControl.tsx": "Empty placeholder for ramp control functionality.",
  "frontend/src/pages/ReportIssueScreen.tsx": "React screen for scanning equipment, capturing details, photos, and GPS, and submitting an issue report with equipment updates and activity logs.",
  "frontend/src/pages/SignInScreen.tsx": "Login screen handling operator/admin modes, calling AuthContext.login, and managing UI state and errors.",
  "frontend/src/types/zxing.d.ts": "Type definitions for ZXing browser-based barcode/QR readers loaded from the global window.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state metadata outlining features, architecture, and known issues for Ramp Track.",
  "unknown.bash": "Simple build script running pnpm build in the frontend directory.",
  "unknown.txt": "Instructions for hosting and installing an Android APK, enabling unknown sources, and granting permissions. Includes demo login, feature list, troubleshooting tips, version info, and support guidance."
}