{
  "backend/main.mo": "Motoko backend managing access control, user profiles, blob storage, and CRUD operations for equipment, assignments, issues, sessions, and activity logs with role‑based permissions.",
  "feature_evidence.json": "Feature evidence record describing required updates to App.tsx for auth-based navigation and related component dependencies.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose and behavior of major frontend files and components.",
  "frontend/docs/ANDROID_APK_GUIDE.md": "Guide explaining how to generate an Android APK from the PWA using PWABuilder with prerequisites and step-by-step instructions.",
  "frontend/docs/APK_BUILD_INSTRUCTIONS.md": "Detailed instructions for building the Ramp Track Android APK via PWABuilder or Bubblewrap, including required PWA readiness and configuration.",
  "frontend/docs/APK_DEPLOYMENT_GUIDE.md": "Guide for deploying the generated Android APK, covering prerequisites and distribution methods.",
  "frontend/docs/APK_DOWNLOAD_LINK.md": "Short guide explaining how to host and distribute the generated APK, including GitHub Releases instructions.",
  "frontend/docs/APK_QUICK_START.md": "Quick-start guide for generating an Android APK from the PWA using PWABuilder in minutes.",
  "frontend/docs/INCIDENT_REPORT.md": "Incident report documenting credit overuse, deployment failures, scanner issues, and requests for technical and billing intervention.",
  "frontend/index.html": "Main HTML entry file configuring PWA metadata, preloaded assets, ZXing loader, root mount point, and service worker auto-update logic.",
  "frontend/index.ts": "Snippet decoding image data for QR scanning using a reader instance.",
  "frontend/public/manifest.json": "Defines PWA metadata, icons, shortcuts, and share target configuration for Ramp Track.",
  "frontend/public/sw.js": "Implements a service worker with versioned caching, network-first navigation, and selective request bypassing for build and API assets.",
  "frontend/src/App.tsx": "Main application component managing auth state, hash-based navigation, and refresh overlay behavior.",
  "frontend/src/components/AuthDiagnosticsPanel.tsx": "Empty placeholder component.",
  "frontend/src/components/DemoLoginHandler.tsx": "Empty placeholder component.",
  "frontend/src/components/EquipmentQRScanner.tsx": "Provides a camera-based QR scanning UI with torch control, error states, and callbacks for login or equipment scanning.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary that displays a full-screen error UI with diagnostics, reload, and cache-clearing actions.",
  "frontend/src/components/LoginScreen.tsx": "Handles user login via username/password or badge scan, integrating with AuthContext and a QR scanner.",
  "frontend/src/components/NotFound.tsx": "Renders a 404 page with a background image and a button that navigates home via callback or redirect.",
  "frontend/src/components/OfflineIndicator.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/PWAUpdateNotification.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ReconnectingOverlay.tsx": "Shows a modal overlay with a spinner during session refresh and supports delayed dismissal.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Displays role selection UI using images and shows the signed‑in user's name from auth context.",
  "frontend/src/components/SignOnScreen.tsx": "Provides login route options based on user roles and redirects back if no user is present.",
  "frontend/src/components/SplashScreen.tsx": "Shows a full‑screen splash image with a loading spinner and status text.",
  "frontend/src/contexts/AuthContext.tsx": "Manages authentication state, session hydration, login, logout, and session refresh using localStorage.",
  "frontend/src/data/gates.ts": "Exports a static readonly list of gate coordinate objects with lat/lon and radius values.",
  "frontend/src/data/userRoster.ts": "Contains the full static user roster used for validating logins and badge scans.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.tsx": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for reading and mutating equipment, assignments, and issues using the actor with authentication checks.",
  "frontend/src/index.css": "Tailwind CSS base styles defining light/dark themes and touch‑friendly UI variables for the app.",
  "frontend/src/lib/apiClient.ts": "Implements a centralized authenticated fetch wrapper with token handling, refresh state tracking, and structured error responses.",
  "frontend/src/lib/auditLog.ts": "Manages local audit log storage for scan events, including adding, retrieving, filtering, and clearing events with user data resolution.",
  "frontend/src/lib/autoGateLocator.ts": "Provides GPS-based nearest-gate detection using Haversine distance and returns a gate label or 'Out of area'.",
  "frontend/src/lib/ensureUserContext.ts": "Retrieves user context from localStorage with fallbacks and validates sessions without clearing local auth on backend errors.",
  "frontend/src/lib/equipmentHistory.ts": "Implements an in-memory log of equipment events with functions to add, query, and clear history.",
  "frontend/src/lib/equipmentRegistry.ts": "Manages client-side equipment records with localStorage persistence, ID normalization, initialization, and status/history updates.",
  "frontend/src/lib/parseBadge.ts": "Extracts the longest digit sequence from scanner input as a badge ID, returning null if under four digits.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders an admin dashboard showing equipment, assignments, audit logs, and update tools with filtering and periodic refresh.",
  "frontend/src/pages/CheckInScreen.tsx": "Implements equipment check-in with scanning, validation, GPS capture, and backend logging.",
  "frontend/src/pages/CheckOutScreen.tsx": "UI flow for scanning equipment, validating availability, capturing GPS, and creating a checkout assignment.",
  "frontend/src/pages/DEBUG_SAFE.tsx": "Simple debug page confirming root app boot.",
  "frontend/src/pages/EquipmentDetailScreen.tsx": "Displays equipment details and history with status badges and fallback when not found.",
  "frontend/src/pages/ManageEquipmentScreen.tsx": "Allows adding, editing, and searching equipment records with session validation.",
  "frontend/src/pages/OperatorHomeScreen.tsx": "Main operator menu providing navigation to checkout, return, and issue reporting actions.",
  "frontend/src/pages/ProfileSetupScreen.tsx": "Empty placeholder screen.",
  "frontend/src/pages/RampControl.tsx": "Empty placeholder screen.",
  "frontend/src/pages/ReportIssueScreen.tsx": "Workflow for scanning equipment, entering issue details, capturing photos, and submitting an issue report.",
  "frontend/src/pages/SignInScreen.tsx": "React login screen handling operator/admin modes, credential input, and AuthContext login with localStorage persistence and conditional rendering based on auth state.",
  "frontend/src/types/zxing.d.ts": "TypeScript declarations for ZXingBrowser global barcode/QR reader APIs loaded from CDN.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters, persist them in sessionStorage, and modify hash parameters without reloading.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing features, architecture, and known issues for the Ramp Track app.",
  "unknown.bash": "Simple script that navigates to the frontend directory and runs the build command.",
  "unknown.txt": "Instructions for hosting, installing, and using an Android APK build of the Ramp Track app with troubleshooting and feature notes."
}