{
  "backend/main.mo": "Motoko canister managing access control, user profiles, equipment, assignments, issues, sessions, logs, and blob storage with admin/user permission checks.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Text file listing generated summaries for all frontend source files.",
  "frontend/docs/ANDROID_APK_GUIDE.md": "Guide describing how to build an Android APK for the PWA using PWABuilder and required prerequisites.",
  "frontend/docs/APK_BUILD_INSTRUCTIONS.md": "Detailed instructions for generating a TWA-based Android APK via PWABuilder or Bubblewrap.",
  "frontend/docs/APK_DEPLOYMENT_GUIDE.md": "Steps for deploying the Android APK, including PWA readiness and PWABuilder workflow.",
  "frontend/docs/APK_DOWNLOAD_LINK.md": "Guide explaining how to host and distribute the generated APK, including GitHub Releases.",
  "frontend/docs/APK_QUICK_START.md": "Quick-start instructions for creating an APK via PWABuilder in minutes.",
  "frontend/docs/INCIDENT_REPORT.md": "Incident report detailing credit overuse, build failures, scanner issues, and deployment problems for escalation.",
  "frontend/index.html": "Main HTML file configuring PWA metadata, asset preload, ZXing script loading, and auto-updating service worker registration.",
  "frontend/index.ts": "Snippet showing image data extraction and decodeFromImageData call for QR scanning.",
  "frontend/public/manifest.json": "Defines the PWA metadata, icons, shortcuts, screenshots, and share targets for Ramp Track.",
  "frontend/public/sw.js": "Implements a service worker handling caching, versioned asset management, and network-first fetch strategies.",
  "frontend/src/App.tsx": "Main app component managing authentication state, hash-based navigation, and reconnect overlay logic.",
  "frontend/src/components/AuthDiagnosticsPanel.tsx": "Empty placeholder file for an authentication diagnostics panel.",
  "frontend/src/components/DemoLoginHandler.tsx": "Empty placeholder file for demo login handling logic.",
  "frontend/src/components/EquipmentQRScanner.tsx": "QR scanning component providing camera initialization, scanning UI overlays, and callback handling for login or equipment modes.",
  "frontend/src/components/ErrorBoundary.tsx": "Error boundary that displays a fallback screen, offers reload and cache-clear options, and can show diagnostics.",
  "frontend/src/components/LoginScreen.tsx": "Login UI handling username/password entry, badge scanning, validation, and triggering AuthContext login.",
  "frontend/src/components/NotFound.tsx": "Displays a 404 page with a background image and a button that returns the user to the home page.",
  "frontend/src/components/OfflineIndicator.tsx": "Empty file with no implemented component.",
  "frontend/src/components/PWAUpdateNotification.tsx": "Empty file with no implemented component.",
  "frontend/src/components/ReconnectingOverlay.tsx": "Shows a reconnecting overlay with a spinner, delayed dismiss option, and fade animations during session refresh.",
  "frontend/src/components/RoleSelectionScreen.tsx": "Presents role selection options and displays the current user’s name using the Auth context.",
  "frontend/src/components/SignOnScreen.tsx": "Displays agent/admin login options based on the user’s roles and redirects back if no user is provided.",
  "frontend/src/components/SplashScreen.tsx": "Renders a splash screen with a background image and loading indicator.",
  "frontend/src/contexts/AuthContext.tsx": "Implements authentication context with session hydration, login handling, and localStorage-based persistence.",
  "frontend/src/data/gates.ts": "Exports a static readonly list of gate IDs with their coordinates and radius values.",
  "frontend/src/data/userRoster.ts": "Provides the full user roster used for authentication, including badge IDs, roles, and optional credentials.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.tsx": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing AuthClient creation, identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for equipment, assignment, and issue operations using the actor, including authenticated mutations with user validation.",
  "frontend/src/index.css": "Tailwind CSS config defining light/dark theme variables, touch‑optimized styles, and rugged‑device UI adjustments.",
  "frontend/src/lib/apiClient.ts": "Implements a centralized API client handling auth tokens, query params, error handling, and structured responses for profile‑missing errors.",
  "frontend/src/lib/auditLog.ts": "Manages local audit log storage for scan events, including reading, writing, filtering, and user identity resolution from localStorage.",
  "frontend/src/lib/autoGateLocator.ts": "Provides a Haversine-based nearest-gate detector returning a gate label within 120m or 'Out of area'.",
  "frontend/src/lib/ensureUserContext.ts": "Retrieves user context from localStorage with fallbacks and validates sessions without clearing local auth on backend errors.",
  "frontend/src/lib/equipmentHistory.ts": "Implements an in-memory log of equipment events with functions to add, query, and clear history.",
  "frontend/src/lib/equipmentRegistry.ts": "Manages equipment records with localStorage persistence, ID normalization, initialization, and required-equipment enforcement.",
  "frontend/src/lib/parseBadge.ts": "Extracts the longest digit sequence from scanner input as a badge ID, returning null if fewer than four digits.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing equipment, assignments, activity logs, and audit data with filters and update capabilities.",
  "frontend/src/pages/CheckInScreen.tsx": "Handles equipment check-in flow including QR scanning, ID normalization, status checks, GPS capture, and backend updates.",
  "frontend/src/pages/CheckOutScreen.tsx": "Checkout workflow that scans equipment QR codes, validates availability, captures GPS, and creates assignment records with activity logging.",
  "frontend/src/pages/DEBUG_SAFE.tsx": "Simple diagnostic page confirming the app booted.",
  "frontend/src/pages/EquipmentDetailScreen.tsx": "Displays equipment details and history, with fallbacks if the ID is not found.",
  "frontend/src/pages/ManageEquipmentScreen.tsx": "Admin interface to view, search, add, and edit equipment records with validation and session checks.",
  "frontend/src/pages/OperatorHomeScreen.tsx": "Home menu for operators to choose actions like taking, returning, or reporting issues with equipment.",
  "frontend/src/pages/ProfileSetupScreen.tsx": "Empty placeholder for future profile setup UI.",
  "frontend/src/pages/RampControl.tsx": "Empty placeholder for ramp control functionality.",
  "frontend/src/pages/ReportIssueScreen.tsx": "Issue reporting workflow that scans equipment, captures details and photos, logs activity, and updates equipment state.",
  "frontend/src/pages/SignInScreen.tsx": "React login screen handling operator/admin preset modes, credential input, and AuthContext login with localStorage persistence.",
  "frontend/src/types/zxing.d.ts": "Type definitions for ZXing Browser API exposed on window, covering multi-format and QR code readers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash params, persisting them in sessionStorage, and clearing stored parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata detailing current architecture, features, known issues, and versioned state for Ramp Track.",
  "unknown.bash": "Build script running pnpm build inside the frontend folder.",
  "unknown.txt": "Instructions for distributing, installing, updating, and troubleshooting the Android APK version of the app."
}