{
  "kind": "build_request",
  "title": "Harden app for reliable production publish and cache-safe startup",
  "projectName": "Ramp Track",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a built-in “deployment diagnostics” indicator in the UI that clearly shows the current app build/version and basic runtime status (e.g., service worker status, online/offline), so the user can confirm whether production has updated after a publish attempt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Rebuild and publish it. Hopefully that works"
        ]
      },
      "acceptanceCriteria": [
        "A visible app version/build label is rendered somewhere accessible from the login flow (e.g., Login screen footer or a small diagnostics link).",
        "The version/build value is derived from a single constant so it can be updated per release without hunting through multiple files.",
        "The diagnostics display includes whether a service worker is controlling the page and whether the browser is currently online."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a user-invokable “force refresh / clear cached app” control reachable from the login screen that triggers the existing cache/service-worker reset behavior (unregister SW, clear Cache Storage, clear local/session storage as appropriate) and then reloads the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "As long as I can finally get beyond the login screen you keep promising. Rebuild it"
        ]
      },
      "acceptanceCriteria": [
        "Login screen includes a clearly labeled action such as “Troubleshooting: Clear cached app and reload”.",
        "Invoking the action unregisters any service workers for the origin (when supported), clears Cache Storage, and reloads the page.",
        "The action uses plain English confirmation/warning text before destructive clearing occurs."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make service worker registration in frontend/index.html conditional via a URL query parameter (e.g., ?nosw=1) to allow a publish verification path that bypasses service worker caching entirely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I want to understand why the error is happening first so I can make the app and changes go live.."
        ]
      },
      "acceptanceCriteria": [
        "When the page is loaded with ?nosw=1 (or equivalent documented parameter), no service worker is registered and a console log indicates SW registration was intentionally skipped.",
        "When the parameter is absent, current service worker registration and auto-update behavior continues to work as it does now.",
        "User-facing text remains in English (if any UI exposure is added for this mode)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure frontend/src/App.tsx mounts authentication context inside App.tsx (since frontend/src/main.tsx cannot be edited) by wrapping the existing AppContent subtree with <AuthProvider>, and ensure all useAuth() calls remain inside the provider-mounted subtree without changing existing hash-based navigation and reconnecting overlay behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "On the draft. I can finally get passed the login screen. So I need this to work"
        ]
      },
      "acceptanceCriteria": [
        "App exports a top-level component that renders <AuthProvider><AppContent/></AuthProvider>, ensuring AuthContext is always mounted.",
        "No useAuth() hook is invoked outside AuthProvider.",
        "Existing hash-based routing targets and behaviors remain unchanged (roleSelection/signOn/agentMenu/adminMenu/takeEquipment/returnEquipment/reportIssue/manageEquipment).",
        "Existing reconnecting/refresh overlay behavior continues to function both when logged out and signed in."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit immutable frontend paths: frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts.",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if upgrading stable state is required."
  ],
  "nonGoals": [
    "Fixing Caffeine platform-level production publish/deployment infrastructure errors directly (outside app code).",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}