{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ramp Track - Production publish hardening (diagnostics + cache-safe startup)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a deployment diagnostics indicator showing app build/version plus online/offline and service worker control status, reachable from the login flow.",
      "acceptanceCriteria": [
        "A visible app version/build label is rendered somewhere accessible from the login flow (e.g., Login screen footer or a small diagnostics link).",
        "The version/build value is derived from a single constant so it can be updated per release without hunting through multiple files.",
        "The diagnostics display includes whether a service worker is controlling the page and whether the browser is currently online."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/appBuild.ts",
          "operation": "create",
          "description": "Create a single-source build/version constant (e.g., APP_BUILD_VERSION and optional BUILD_DATE) that the UI can import to render the deployed build label."
        },
        {
          "path": "frontend/src/components/AuthDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Implement the deployment diagnostics UI: render the build/version from the single constant, show navigator.onLine status, and show whether navigator.serviceWorker.controller is present (plus any helpful SW details like controller scriptURL when available)."
        },
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Wire a small, clearly labeled diagnostics entry in the login flow (e.g., footer link/button) that reveals AuthDiagnosticsPanel.tsx and shows the build label somewhere visible on the login screen."
        },
        {
          "path": "frontend/src/components/OfflineIndicator.tsx",
          "operation": "modify",
          "description": "Implement the existing placeholder as a small reusable indicator that listens to online/offline events and can be used by AuthDiagnosticsPanel and/or LoginScreen to reflect connectivity."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a user-invokable force refresh / clear cached app action on the login screen that clears caches/storage, unregisters service workers, then reloads after confirmation.",
      "acceptanceCriteria": [
        "Login screen includes a clearly labeled action such as “Troubleshooting: Clear cached app and reload”.",
        "Invoking the action unregisters any service workers for the origin (when supported), clears Cache Storage, and reloads the page.",
        "The action uses plain English confirmation/warning text before destructive clearing occurs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/clearCachedApp.ts",
          "operation": "create",
          "description": "Add a shared utility to perform the destructive reset flow: show an English confirmation dialog, unregister all service workers for the origin when supported, clear Cache Storage, clear localStorage and sessionStorage as appropriate, then reload the page."
        },
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled troubleshooting control on the login screen that calls the shared clearCachedApp utility and uses plain-English warning/confirmation messaging before clearing."
        },
        {
          "path": "frontend/src/components/ErrorBoundary.tsx",
          "operation": "modify",
          "description": "Refactor the existing “Clear Cache & Reload” behavior to reuse the shared clearCachedApp utility so the clearing behavior is consistent across error recovery and login troubleshooting."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make service worker registration conditional in index.html via a URL query parameter (e.g., ?nosw=1) for cache-bypassed publish verification.",
      "acceptanceCriteria": [
        "When the page is loaded with ?nosw=1 (or equivalent documented parameter), no service worker is registered and a console log indicates SW registration was intentionally skipped.",
        "When the parameter is absent, current service worker registration and auto-update behavior continues to work as it does now.",
        "User-facing text remains in English (if any UI exposure is added for this mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the service worker registration script to check a query parameter (nosw=1) and skip registration when present, logging to the console that registration was intentionally bypassed; preserve existing registration and auto-update behavior when absent."
        },
        {
          "path": "frontend/src/components/AuthDiagnosticsPanel.tsx",
          "operation": "modify",
          "description": "Include a small note in the diagnostics UI indicating whether the current page was loaded in no-service-worker mode (nosw=1) so publish verification behavior is obvious to the user."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure AuthProvider is mounted in App.tsx wrapping AppContent, with no useAuth() usage outside the provider, while preserving existing hash navigation and reconnect overlay behavior.",
      "acceptanceCriteria": [
        "App exports a top-level component that renders <AuthProvider><AppContent/></AuthProvider>, ensuring AuthContext is always mounted.",
        "No useAuth() hook is invoked outside AuthProvider.",
        "Existing hash-based routing targets and behaviors remain unchanged (roleSelection/signOn/agentMenu/adminMenu/takeEquipment/returnEquipment/reportIssue/manageEquipment).",
        "Existing reconnecting/refresh overlay behavior continues to function both when logged out and signed in."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm/adjust App.tsx so the exported top-level App renders <AuthProvider><AppContent/></AuthProvider> (since main.tsx cannot be edited), and ensure any useAuth() calls remain inside AppContent; keep existing hash-based view names and reconnecting overlay logic unchanged."
        }
      ]
    }
  ]
}