{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix post-login navigation by ensuring AuthProvider is mounted and hash is corrected on auth",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Mount AuthProvider at the application root in main.tsx while preserving existing QueryClientProvider and InternetIdentityProvider wrappers.",
      "acceptanceCriteria": [
        "`frontend/src/main.tsx` renders a non-empty React tree that includes `<App />` wrapped with `<AuthProvider>`.",
        "After a successful login (manual, camera badge scan, or keyboard-wedge scan), `useAuth().auth` becomes truthy and `App.tsx` re-renders into the signed-in UI instead of remaining on `LoginScreen`.",
        "No changes are made to any files under `frontend/src/hooks/useInternetIdentity.ts` / `useActor.ts` or `frontend/src/components/ui` (immutable paths)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Import `AuthProvider` from `./contexts/AuthContext` and wrap the existing provider tree so that `<QueryClientProvider>` remains outermost (as today), `InternetIdentityProvider` remains preserved, and `<AuthProvider>` wraps `<App />` (or wraps all children under existing providers) to ensure `useAuth()` is connected to the mounted provider and can update `auth` for navigation beyond `LoginScreen`."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure App.tsx sets a valid signed-in hash route when auth becomes truthy and the current hash is empty/invalid, without disrupting existing hash routing or reconnect overlay behavior.",
      "acceptanceCriteria": [
        "When `auth` transitions from falsy to truthy, the app renders the signed-in flow and sets `window.location.hash` to a valid view (at minimum `#roleSelection`) if none is present.",
        "If the URL hash is already a valid signed-in view, the app does not override it on auth changes.",
        "The reconnecting/refresh overlay continues to work on both logged-out (`LoginScreen`) and signed-in screens (including subscribe-to-refresh-state behavior, auto-dismiss timeout, and user dismiss)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add an auth-driven navigation correction: when `auth` transitions from falsy to truthy, check the current `window.location.hash` and, if it is empty or does not match a valid signed-in `ViewType`, set `window.location.hash` to `#roleSelection`. Ensure this logic does not override an already-valid signed-in hash, preserves the existing hashchange subscription/currentView state flow, and does not alter the reconnecting/refresh overlay subscription, auto-dismiss timeout, or user-dismiss behavior."
        }
      ]
    }
  ]
}